### missing values are represents 
- None
- NaN(not a number)

In [ ]:
# will create a dataset having missing values

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [3]:
data1.isnull()

    name  salary    age
0  False   False   True
1  False   False  False
2  False    True  False
3   True   False  False

In [4]:
data1.isnull().sum()

name      1
salary    1
age       1
dtype: int64

In [5]:
# how to fill these missing values

In [6]:
data1.isna()

    name  salary    age
0  False   False   True
1  False   False  False
2  False    True  False
3   True   False  False

In [7]:
data1.isna().sum()

name      1
salary    1
age       1
dtype: int64

In [8]:
data1.isna().count()
# count give count of all values of keys 
# so don't use count use sum
# useless..............> rows count

name      4
salary    4
age       4
dtype: int64

# case-1

### fillna
- fill missing values with some number

In [9]:
data1.fillna("ravi")
# here ravi is fill at all missing values 
# here ravi also filled in numerical values

       name salary   age
0       ram  100.0  ravi
1  lakshman   90.0  30.0
2   krishna   ravi  40.0
3      ravi   95.0  50.0

In [10]:
data1.fillna(29)
# here 29 is filled on all missing values 
# 29 is also filled in categorical values

       name  salary   age
0       ram   100.0  29.0
1  lakshman    90.0  30.0
2   krishna    29.0  40.0
3        29    95.0  50.0

In [11]:
data1
# our data1 is same
# use inplace is true

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [13]:
data1.fillna(5,inplace=True)

In [14]:
data1

       name  salary   age
0       ram   100.0   5.0
1  lakshman    90.0  30.0
2   krishna     5.0  40.0
3         5    95.0  50.0

In [15]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [16]:
data1.fillna("shyam")

       name salary    age
0       ram  100.0  shyam
1  lakshman   90.0   30.0
2   krishna  shyam   40.0
3     shyam   95.0   50.0

In [17]:
# to fill shyam only in name column
# then 
data1["name"].fillna("shyam")

0         ram
1    lakshman
2     krishna
3       shyam
Name: name, dtype: object

In [18]:
data1["salary"].fillna("93")
# use fillna concept only on specific column

0    100.0
1     90.0
2       93
3     95.0
Name: salary, dtype: object

In [19]:
data1["age"].fillna(20)

0    20.0
1    30.0
2    40.0
3    50.0
Name: age, dtype: float64

In [20]:
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [21]:
data1["age"]=data1["age"].fillna(20)
# we don't need to use inplace like these methods

In [22]:
data1 # 20 value added

       name  salary   age
0       ram   100.0  20.0
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

# case 2

### method = pad

In [23]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [24]:
data1.fillna(method="pad") # shift + tab to show all methods 
# pad method add previous value on null values 
# in age first row no previous value is found so it kept as null

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna    90.0  40.0
3   krishna    95.0  50.0

In [26]:
data1.fillna(method="pad",inplace=True)

In [27]:
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna    90.0  40.0
3   krishna    95.0  50.0

In [28]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [29]:
data1["name"].fillna(method=pad)

NameError: name 'pad' is not defined

In [30]:
data1["name"].fillna(method="pad")
# adding value on a specific column

0         ram
1    lakshman
2     krishna
3     krishna
Name: name, dtype: object

# case 3

- fill missing values with next ones

In [31]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [32]:
data1.fillna(method="bfill") # inplace=True
# in names column after null no value is there so it keep as nan

       name  salary   age
0       ram   100.0  30.0
1  lakshman    90.0  30.0
2   krishna    95.0  40.0
3       NaN    95.0  50.0

In [33]:
data1["salary"].fillna(method="bfill")

0    100.0
1     90.0
2     95.0
3     95.0
Name: salary, dtype: float64

In [34]:
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

# case 4

- drop values

In [35]:
# you have a data 100000000
# in that 2% percent data has missing values 
# 100-2=98 , 1000-20=980,  10000-200=9800,  100000-2000=98000(enough)
# ML......> data should be high 
# data is very less .......> drop the values(not allowed)
# data is very hugs ........> till 5% if you have missing values(drop the data)

In [36]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [37]:
data1.dropna()
# the rows have null values are droped

       name  salary   age
1  lakshman    90.0  30.0

In [38]:
data1.dropna()
# it will check row wise 
# if any row has NaN, it will drop that row
# axis-1.......> columns
# axis-0.........> rows (bydefault)

       name  salary   age
1  lakshman    90.0  30.0

In [39]:
data1.dropna(axis=0)

       name  salary   age
1  lakshman    90.0  30.0

In [40]:
data1.dropna(axis=1)
# drop the columns,whose having null values

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [41]:
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [44]:
data1["name"].dropna()
# it will show values without null values

0         ram
1    lakshman
2     krishna
Name: name, dtype: object

In [46]:
data2=data1.iloc[[0,1,2]]
data2

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0

In [47]:
data2.dropna(axis=1)

       name
0       ram
1  lakshman
2   krishna

In [48]:
# we can fill missing values with some random number
# with specific column also 
# fill missing values with previous value
# fill missing values with after value
# drop the missing values 
# drop the missing values using axis

**fill the missing values by using mean-median-mode**

- you need to do column wise
- some columns are numerical and some other columns are categorical 
- for categorical we can't apply mean and median
- for numerical columns apply mean/median
- for categorical columns apply mode

In [49]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [51]:
# mean/median
sal_mean=data1["salary"].mean()
sal_mean

95.0

In [52]:
data1["salary"]=data1["salary"].fillna(sal_mean) 
# no need of inplace=True

In [53]:
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna    95.0  40.0
3       NaN    95.0  50.0

In [54]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [55]:
data1["age"].fillna(data1["age"].median())

0    40.0
1    30.0
2    40.0
3    50.0
Name: age, dtype: float64

In [58]:
data1["age"]=data1["age"].fillna(data1["age"].median())
data1

       name  salary   age
0       ram   100.0  40.0
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [59]:
dict1={"name":["ram","lakshman","krishna",np.nan],
      "salary":[100,90,np.nan,95],
      "age":[np.nan,30,40,50]}
data1=pd.DataFrame(dict1)
data1

       name  salary   age
0       ram   100.0   NaN
1  lakshman    90.0  30.0
2   krishna     NaN  40.0
3       NaN    95.0  50.0

In [61]:
mod=data1["name"].mode()
mod 
# why all values are showing bcz there is no mode

0     krishna
1    lakshman
2         ram
Name: name, dtype: object